// 4. Напишите программу вычисления модуля числа.

Console.WriteLine("Write a number");
int N = int.Parse(Console.ReadLine());
Console.WriteLine($"{Math.Abs(N)}");